package com.room406.inventory;

import com.room406.actions.IAction;

/**
 * Created by user on 03.08.2015.
 */
public class Schedule extends InventoryItem implements IUsable{
    public Schedule() {
        super("расписание", "расписание", "Это твое расписание", 0, "%s висит на стене");
    }
    @Override
    public IAction use() {
        System.out.println(
                "+-------+-------------------+--------+\n" +
                "|       |пн  вт  ср  чт  пт | сб  вс |\n" +
                "+-------+-------------------+--------|\n" +
                "|  8-10 +           завтрак          +\n" +
                "+-------+-------------------+--------|\n" +
                "| 10-13 +     прога 317     +   TB   +\n" +
                "+-------+-------------------+--------|\n" +
                "| 13-15 +            обед            +\n" +
                "+-------+-------------------+--------|\n" +
                "| 15-18 +  английский 410   +   TB   +\n" +
                "+-------+-------------------+--------|\n" +
                "| 18-20 +            ужин            +\n" +
                "+-------+-------------------+--------+\n"
        );
        return null;
    }
}
